In [2]:
import pandas as pd

# group by

In [11]:
df = pd.DataFrame(
    {
        'id': [1, 1, 2, 2, 2],
        'content': ['A', 'B', 'C', 'D', 'E'],
        'price': [1, 2, 3, 4, 5]
    }
)
df

   id content  price
0   1       A      1
1   1       B      2
2   2       C      3
3   2       D      4
4   2       E      5

In [13]:
dfg = df.groupby('id')
dfres = dfg.agg('sum', numeric_only=False)
print(dfres)
dfres = dfg.sum()
print(dfres)

   content  price
id
1       AB      3
2      CDE     12
    price
id
1       3
2      12

/tmp/ipykernel_2488274/3927814625.py:4: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  dfres = dfg.sum()

In [19]:
df.groupby('id').agg(
    {  
        # by的column就不用了
        "content": ['first'],
        # "price"  # 字典没有这个字段结果就没有
    }
)

   content
     first
id
1        A
2        C

In [29]:
df.groupby('id').agg(
    {  
        "content": lambda x: '|'.join(x),
        "price": sum
    }
)

   content  price
id
1      A|B      3
2    C|D|E     12

In [27]:
df.groupby('id')['id'].tolist()

AttributeError: 'SeriesGroupBy' object has no attribute 'tolist'

In [24]:
df.groupby('id')['content'].sum()

id
1     AB
2    CDE
Name: content, dtype: object

In [61]:
dfres = df.groupby('id').agg(
    {  
        "content": ['first'],
        "price": sum
    }
)
dfres

   content price
     first   sum
id
1        A     3
2        C    12

In [40]:
dfres.index, dfres.columns

(Int64Index([1, 2], dtype='int64', name='id'),
 MultiIndex([('content', 'first'),
             (  'price',   'sum')],
            ))

In [47]:
df.index, df.columns

(RangeIndex(start=0, stop=5, step=1),
 Index(['id', 'content', 'price'], dtype='object'))

In [44]:
type(dfres['content']), type(dfres['content']['first'])

(pandas.core.frame.DataFrame, pandas.core.series.Series)

In [62]:
dfres

   content price
     first   sum
id
1        A     3
2        C    12

In [63]:
dfres.columns

MultiIndex([('content', 'first'),
            (  'price',   'sum')],
           )

In [57]:
dfres.to_dict()

{('content', 'first'): {1: 'A', 2: 'C'}, ('price', 'sum'): {1: 3, 2: 12}}

In [58]:
dfres.columns = ['content', 'price']
dfres

   content  price
id
1        A      3
2        C     12

In [60]:
dfres.columns

Index(['content', 'price'], dtype='object')

In [59]:
dfres.to_dict()

{'content': {1: 'A', 2: 'C'}, 'price': {1: 3, 2: 12}}

In [55]:
df.to_dict()

{'id': {0: 1, 1: 1, 2: 2, 3: 2, 4: 2},
 'content': {0: 'A', 1: 'B', 2: 'C', 3: 'D', 4: 'E'},
 'price': {0: 1, 1: 2, 2: 3, 3: 4, 4: 5}}

In [68]:
string ="a{1}".format(1, 'xxx')
string

'axxx'

# replace update

利用另一个df的两列，一个作为索引，一个做替换值

In [29]:
import pandas as pd
 
# Creating dataframe
df1 = pd.DataFrame([["rumul", 10, 12, 10],
                    ["rahul", 10, 11, 16],
                    ["purvi", 18, 14, 10],
                    ["ravi", 20, 13, 30]],
                   columns=["Name1", "Maths",
                            "Physics",
                            "Chemistry"])
df2 = pd.DataFrame(
  [["rahul", 1, 1]],
  columns=["Name2", "Maths", "Physics"])

In [30]:
df1

   Name1  Maths  Physics  Chemistry
0  rumul     10       12         10
1  rahul     10       11         16
2  purvi     18       14         10
3   ravi     20       13         30

In [31]:
df2

   Name2  Maths  Physics
0  rahul      1        1

In [32]:
# 按index索引，相同的column都改了
df1.update(df2)
df1

   Name1  Maths  Physics  Chemistry
0  rumul    1.0      1.0         10
1  rahul   10.0     11.0         16
2  purvi   18.0     14.0         10
3   ravi   20.0     13.0         30

In [12]:
# 设置相同的column, 但是默认使用了index做索引
df2.columns = df1.columns[:3]
df1.update(df2)
df1

   Name1  Maths  Physics  Chemistry
0  rahul    1.0      1.0         10
1  rahul   10.0     11.0         16
2  purvi   18.0     14.0         10
3   ravi   20.0     13.0         30

In [14]:
# 1、set_index选择想要对其的column
df1.set_index('Name1', inplace=True)
df2.set_index('Name2', inplace=True)
df1.update(df2)
df1

       Maths  Physics  Chemistry
Name1
rumul   10.0     12.0         10
rahul    1.0      1.0         16
purvi   18.0     14.0         10
ravi    20.0     13.0         30

In [15]:
df1.reset_index()

   Name1  Maths  Physics  Chemistry
0  rumul   10.0     12.0         10
1  rahul    1.0      1.0         16
2  purvi   18.0     14.0         10
3   ravi   20.0     13.0         30

In [27]:
# 2、使用merge统一index
# 注意：df1只取索引列
df2ud = df1[['Name1']].merge(df2, left_on=['Name1'], right_on=['Name2'], how='left')
df2ud

   Name1  Name2  Maths  Physics
0  rumul    NaN    NaN      NaN
1  rahul  rahul    1.0      1.0
2  purvi    NaN    NaN      NaN
3   ravi    NaN    NaN      NaN

In [28]:
df1.update(df2ud)
df1

   Name1  Maths  Physics  Chemistry
0  rumul   10.0     12.0         10
1  rahul    1.0      1.0         16
2  purvi   18.0     14.0         10
3   ravi   20.0     13.0         30

# temp

In [16]:
import srsly
import re

In [4]:
data = list(srsly.read_jsonl('/home/yhao/temp/for_zoe_check.jsonl'))

In [28]:
df = pd.DataFrame(data)
df = df[['text', 'labels']]
df['labels'] = df['labels'].apply(lambda x: x[0])
df = df.sort_values(by=['labels'])
df.head()

        text       labels
2593  国货越来越好  Brand-Brand
25       大品牌  Brand-Brand
2704    名副其实  Brand-Brand
802       老牌  Brand-Brand
28        品牌  Brand-Brand

In [29]:
df.to_excel('/home/yhao/temp/for_zoe_check.xlsx', index=False)

In [47]:
dfdup = pd.concat([df[:5], df[:5]])
dfdup

        text       labels
2593  国货越来越好  Brand-Brand
25       大品牌  Brand-Brand
2704    名副其实  Brand-Brand
802       老牌  Brand-Brand
28        品牌  Brand-Brand
2593  国货越来越好  Brand-Brand
25       大品牌  Brand-Brand
2704    名副其实  Brand-Brand
802       老牌  Brand-Brand
28        品牌  Brand-Brand

In [49]:
tuple(dfdup.apply(tuple, axis=1).values)

(('国货越来越好', 'Brand-Brand'),
 ('大品牌', 'Brand-Brand'),
 ('名副其实', 'Brand-Brand'),
 ('老牌', 'Brand-Brand'),
 ('品牌', 'Brand-Brand'),
 ('国货越来越好', 'Brand-Brand'),
 ('大品牌', 'Brand-Brand'),
 ('名副其实', 'Brand-Brand'),
 ('老牌', 'Brand-Brand'),
 ('品牌', 'Brand-Brand'))

In [50]:
for line in dfdup.apply(tuple, axis=1).values:
    print(line)

('国货越来越好', 'Brand-Brand')
('大品牌', 'Brand-Brand')
('名副其实', 'Brand-Brand')
('老牌', 'Brand-Brand')
('品牌', 'Brand-Brand')
('国货越来越好', 'Brand-Brand')
('大品牌', 'Brand-Brand')
('名副其实', 'Brand-Brand')
('老牌', 'Brand-Brand')
('品牌', 'Brand-Brand')